api/app/Controllers/Pessoas.php

    public function find($cod_pessoa)
    {
        $response = [];

        if ($this->_validaToken() == true) {

            $data = $this->pessoasModel->find($cod_pessoa);
---
SELECT *
FROM `pessoas`
WHERE `pessoas`.`cod_pessoa` = '2'


            try {

                if ($this->pessoasModel->insert($newPessoa)) {
---
INSERT INTO `pessoas` (`nome_completo`, `rg`, `cpf`, `data_nascimento`, `cep`, `logradouro`, `numero`, `complemento`, `bairro`, `cidade`, `estado`) VALUES ('Teste Bruno', '345657675', '12345656780', '1992-01-10', '02991-070', 'Rua Morro de Santa', '49', 'CS 3', 'Jardim Rincão', 'São Paulo', 'SP')

    public function update($cod_pessoa = null)
    {
        $response = [];

        if ($this->_validaToken() == true) {

            // primeiro passo é verificar se a pessoa realmente existe
            $data = $this->pessoasModel->find($cod_pessoa);
---
SELECT *
FROM `pessoas`
WHERE `pessoas`.`cod_pessoa` = '2'


                    try {

                        if ($this->pessoasModel->update($cod_pessoa, $newPessoa)) {
---
UPDATE `pessoas` SET `nome_completo` = 'Andressa Soares', `rg` = '345657675', `cpf` = '12345656788', `data_nascimento` = '1992-01-10', `cep` = '02991-070', `logradouro` = 'Rua Morro de Santa', `numero` = '49', `complemento` = 'CS 3', `bairro` = 'Jardim Rincão', `cidade` = 'São Paulo', `estado` = 'SP'
WHERE `pessoas`.`cod_pessoa` IN ('2')

    public function cancel($cod_pessoa = null)
    {
        $response = [];

        if ($this->_validaToken() == true) {

            // primeiro passo é verificar se a pessoa realmente existe
            $data = $this->pessoasModel->find($cod_pessoa);

            if (!$data) {

                $response = [
                    'response'  => 'error',
                    'msg'       => 'Pessoa não encontrada'
                ];

            } else {

                $data['excluido']        = 'Y';
                $data['dth_excluido']   = date('Y-m-d H:i:s');

                try {

                    if ($this->pessoasModel->update($cod_pessoa, $data)) {
---
SELECT *
FROM `pessoas`
WHERE `pessoas`.`cod_pessoa` = '2'
UPDATE `pessoas` SET `nome_completo` = 'Andressa Soares', `rg` = '345657675', `cpf` = '12345656788', `data_nascimento` = '1992-01-10', `cep` = '02991-070', `logradouro` = 'Rua Morro de Santa', `numero` = '49', `complemento` = 'CS 3', `bairro` = 'Jardim Rincão', `cidade` = 'São Paulo', `estado` = 'SP', `excluido` = 'N', `dth_excluido` = '2022-03-01 18:14:30'
WHERE `pessoas`.`cod_pessoa` IN ('2')